# Sorting and Ranking

In [51]:
import pandas as pd
import numpy as np

## sort in series

In [52]:
objet = pd.Series(range(4),index=['b','c','a','d'])

In [53]:
objet

b    0
c    1
a    2
d    3
dtype: int64

In [54]:
objet.sort_index()

a    2
b    0
c    1
d    3
dtype: int64

In [62]:
obj = pd.Series([4,-1,5,7])

In [63]:
obj

0    4
1   -1
2    5
3    7
dtype: int64

In [66]:
obj.sort_values(ascending=False)

3    7
2    5
0    4
1   -1
dtype: int64

In [67]:
obj = pd.Series([7,9,np.nan,-1,np.nan,5,7])

In [68]:
obj

0    7.0
1    9.0
2    NaN
3   -1.0
4    NaN
5    5.0
6    7.0
dtype: float64

In [69]:
obj.sort_values()

3   -1.0
5    5.0
0    7.0
6    7.0
1    9.0
2    NaN
4    NaN
dtype: float64

## sort in  dataframe

In [55]:
frame = pd.DataFrame(np.arange(8).reshape(2,4),index=['three','one'],columns=['b','c','a','d'])

In [56]:
frame

       b  c  a  d
three  0  1  2  3
one    4  5  6  7

In [57]:
frame.sort_index()

       b  c  a  d
one    4  5  6  7
three  0  1  2  3

In [58]:
frame.sort_index(axis=1)

       a  b  c  d
three  2  0  1  3
one    6  4  5  7

In [60]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  3  1  0  2
one    7  5  4  6

In [71]:
frame = pd.DataFrame({"A":[4,5,6,9,7,8],'B':[7,9,-8,4,6,9]})

In [72]:
frame

   A  B
0  4  7
1  5  9
2  6 -8
3  9  4
4  7  6
5  8  9

In [74]:
frame.sort_values(by="A")

   A  B
0  4  7
1  5  9
2  6 -8
4  7  6
5  8  9
3  9  4

In [75]:
frame.sort_values(['A',"B"])

   A  B
0  4  7
1  5  9
2  6 -8
4  7  6
5  8  9
3  9  4

## rank function

In [76]:
obj = pd.Series([7,9,-4,7,8,6,5,4,9,7])

In [77]:
obj

0    7
1    9
2   -4
3    7
4    8
5    6
6    5
7    4
8    9
9    7
dtype: int64

In [78]:
obj.rank()

0    6.0
1    9.5
2    1.0
3    6.0
4    8.0
5    4.0
6    3.0
7    2.0
8    9.5
9    6.0
dtype: float64

In [79]:
obj.rank(method='min')

0    5.0
1    9.0
2    1.0
3    5.0
4    8.0
5    4.0
6    3.0
7    2.0
8    9.0
9    5.0
dtype: float64

In [80]:
obj.rank(method='max')

0     7.0
1    10.0
2     1.0
3     7.0
4     8.0
5     4.0
6     3.0
7     2.0
8    10.0
9     7.0
dtype: float64

In [81]:
frame = pd.DataFrame({"b":[1,8,6,7],'a':[7,8,3,4],"c":[7,9,5,6]})

In [82]:
frame

   b  a  c
0  1  7  7
1  8  8  9
2  6  3  5
3  7  4  6

In [84]:
frame.rank(method="min")

     b    a    c
0  1.0  3.0  3.0
1  4.0  4.0  4.0
2  2.0  1.0  1.0
3  3.0  2.0  2.0

In [85]:
frame.rank(axis='columns')

     b    a    c
0  1.0  2.5  2.5
1  1.5  1.5  3.0
2  3.0  1.0  2.0
3  3.0  1.0  2.0